# FabricationConfiguration Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration Class
Members See Also
---
This element contains the information about the fabrication configuration settings used by the project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class FabricationConfiguration : Element
```

Visual Basic
---
```text
Public Class FabricationConfiguration _
	Inherits Element
```

Visual C++
---
```text
public ref class FabricationConfiguration : public Element
```

# Remarks
The element provides information about the location of the fabrication database, its properties, and settings related to fabrication items.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..FabricationConfiguration
# See Also
FabricationConfiguration Members
Autodesk.Revit.DB Namespace